In [6]:
import sqlite3

connection = sqlite3.connect("university.db")
cursor = connection.cursor()

In [4]:
query = """   
CREATE TABLE student(
    StudentId INTEGER PRIMARY KEY AUTOINCREMENT,
    Name TEXT NOT NULL,
    Age INTEGER CHECK(Age>31),
    Major TEXT DEFAULT 'Undeclared',
    RegisteredAt TIMESTAMP DEFAULT CURRENT_TIMESTAMP 
)
"""

cursor.execute(query)

In [12]:
row1 = """ 
INSERT INTO student(Name,Age) Values('priyanka',35)
"""
cursor.execute(row1)

connection.commit()

In [14]:
import pandas as pd

student_data = pd.read_sql_query("select * from student",connection)
student_data

   StudentId      Name  Age       Major         RegisteredAt
0          1  priyanka   35  Undeclared  2025-06-25 14:05:42
1          2  priyanka   35  Undeclared  2025-06-25 14:06:58